name: "intent_model_onnx"
platform: "onnxruntime_onnx"
max_batch_size: 1
input {
  name: "input_ids"
  data_type: TYPE_INT64
  dims: 128
}
input {
  name: "attention_mask"
  data_type: TYPE_INT64
  dims: 128
}

output {
  name: "logits"
  data_type: TYPE_FP32
  dims: [15]
}
instance_group {
  count: 1
  kind: KIND_GPU
}

default_model_filename: "model.onnx"
