name: "intent_preprocessor"
backend: "python"
max_batch_size: 1
input [
{
    name: "input_text"
    data_type: TYPE_STRING
    dims: [ 1 ]
    reshape: {shape:[]}
}
]
output {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: 128
}
  
output {
    name: "attention_mask"
    data_type: TYPE_INT64
    dims: 128
}


instance_group {
  count: 1
  kind: KIND_CPU
}
