name: "intent_postprocessor"
backend: "python"
max_batch_size: 1
input {
    name: "logits"
    data_type: TYPE_FP32
    dims: [15]
}
  
output {
    name: "labels"
    data_type: TYPE_STRING
    dims: [ 1 ]
}

instance_group {
  count: 1
  kind: KIND_CPU
}
